Revit 2024 API
RebarShapeDefinitionBySegments.NumberOfSegments Property
 The number of straight segments in this shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int NumberOfSegments { get; }
Visual Basic
Public ReadOnly Property NumberOfSegments As Integer
	Get
Visual C++
public:
property int NumberOfSegments {
	int get ();
}
See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace